[
  {
    "id": "1",
    "slug": "exploring-the-himalayas",
    "title": "Exploring the Himalayas",
    "category": "Travel",
    "date": "2025-10-10",
    "updateTime": "2025-10-13",
    "author": "Rakesh Pradhan",
    "excerpt": "Join me as I explore the majestic trails and snow-covered peaks of the Himalayas.",
    "content": "## The Adventure Begins\n\nWe trekked through the snow-covered trails of the Himalayas, where the air was thin but the views were breathtaking. The journey tested our endurance and filled our hearts with peace.\n\n### Finding Serenity\n\nAs the sun rose over the mountains, we felt the spiritual energy of nature reminding us of our place in the universe.",
    "image": "/images/himalayas.jpg"
  },
  {
    "id": "2",
    "slug": "the-future-of-gaming-in-2025",
    "title": "The Future of Gaming in 2025",
    "category": "Gaming",
    "date": "2025-10-09",
    "updateTime": "2025-10-13",
    "author": "Rakesh Pradhan",
    "excerpt": "Discover how AI, VR, and cloud technology are redefining the gaming experience in 2025.",
    "content": "### AI + VR Revolution\n\nGaming in 2025 is no longer just entertainment; it’s an immersive world of creativity. AI-driven NPCs, lifelike physics, and cross-reality gameplay have redefined how we connect through play.\n\n### Cloud Gaming Expansion\n\nCloud platforms make high-end gaming accessible to everyone — no consoles, no downloads, just pure experience.",
    "image": "/images/gaming.jpg"
  },
  {
    "id": "3",
    "slug": "finding-faith-in-modern-times",
    "title": "Finding Faith in Modern Times",
    "category": "Devotion",
    "date": "2025-10-08",
    "updateTime": "2025-10-12",
    "author": "Rakesh Pradhan",
    "excerpt": "A reflection on balancing spirituality and technology in today’s fast-paced life.",
    "content": "### A Digital World, A Spiritual Heart\n\nWe live surrounded by screens, yet the call for inner peace remains timeless. In a world of notifications, faith helps us slow down, breathe, and reconnect.\n\n### Practices for the Soul\n\nMeditation, gratitude, and compassion are timeless tools for modern living — and they fit perfectly within our digital rhythm.",
    "image": "/images/devotion.jpg"
  }
]
